app/views/user_profiles/show.html.erb

SELECT COUNT(*) FROM "meal_plans" WHERE "meal_plans"."user_profile_id" = $1  [["user_profile_id", 9]]
---
              <div class="stat-box p-3">
                <h3 class="mb-1 text-primary"><%= @user_profile.meal_plans.count %></h3>

SELECT COUNT(*) FROM "shopping_lists" WHERE "shopping_lists"."user_profile_id" = $1  [["user_profile_id", 9]]
---
              <div class="stat-box p-3">
                <h3 class="mb-1 text-primary"><%= @user_profile.shopping_lists.count %></h3>

SELECT COUNT(DISTINCT "recipes"."id") FROM "recipes" INNER JOIN "meal_plans" ON "recipes"."id" = "meal_plans"."recipe_id" WHERE "meal_plans"."user_profile_id" = $1  [["user_profile_id", 9]]
---
              <div class="stat-box p-3">
                <h3 class="mb-1 text-primary"><%= @user_profile.recipes.distinct.count %></h3>