app/controllers/meal_plans_controller.rb

  def index
    @meal_plans = @user_profile.meal_plans.includes(:recipe)


    @meal_plans = @meal_plans.sort_by do |mp|
      day_index = DAY_ORDER.index(mp.day) || DAY_ORDER.size
      meal_index = MEAL_ORDER.index(mp.meal_type.capitalize) || MEAL_ORDER.size

      [ day_index, meal_index ]
    end

    @weekly_total = @meal_plans.sum { |mp| mp.recipe.cost }
---
SELECT "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."user_profile_id" = $1  [["user_profile_id", 5]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1  [["id", 55]]
SELECT SUM("recipes"."cost") FROM "meal_plans" INNER JOIN "recipes" ON "recipes"."id" = "meal_plans"."recipe_id"

  def create
    @meal_plan = @user_profile.meal_plans.new(
      recipe_id: params[:recipe_id],
      day: params[:day],
      meal_type: params[:meal_type]
    )

    if @meal_plan.save
---
INSERT INTO "meal_plans" ("created_at", "day", "meal_type", "recipe_id", "updated_at", "user_profile_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2025-11-13 02:16:49.134158"], ["day", "Tuesday"], ["meal_type", "Dinner"], ["recipe_id", 18], ["updated_at", "2025-11-13 02:16:49.134158"], ["user_profile_id", 18]]

  def destroy
    @meal_plan = MealPlan.find(params[:id])
    @meal_plan.destroy
---
SELECT "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "meal_plans" WHERE "meal_plans"."id" = $1  [["id", 8]]

  def set_user_profile
    @user_profile = UserProfile.first
---
SELECT "user_profiles".* FROM "user_profiles" ORDER BY "user_profiles"."id" ASC LIMIT $1  [["LIMIT", 1]]