app/controllers/recipes_controller.rb

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"
SELECT 1 AS one FROM "recipes" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @user_profile = UserProfile.find_by(id: session[:user_profile_id])
    @recipes = Recipe.all

    if @user_profile
      user_appliances = @user_profile.appliances.reject(&:blank?)
      user_dietary_preferences = @user_profile.dietary_preferences.reject(&:blank?)

      @recipes = @recipes.select do |recipe|
        appliances_compatible = if user_appliances.include?("None")
          recipe.appliances_needed.empty?
        else
          (recipe.appliances_needed - user_appliances).empty?
        end

        dietary_compatible = if user_dietary_preferences.include?("None")
          true
        else
          recipe.dietary_tags.empty? || (recipe.dietary_tags & user_dietary_preferences).any?
        end

        appliances_compatible && dietary_compatible
      end
    end

    @recipes = @recipes.select { |r| r.meal_type == params[:meal_type] } if params[:meal_type].present?

INSERT INTO "recipes" ("appliances_needed", "cost", "created_at", "dietary_tags", "ingredients", "ingredients_list", "instructions", "meal_type", "name", "prep_time", "saved", "updated_at", "user_profile_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
      @recipe.appliances_needed = appliances_array.map(&:strip).reject(&:blank?)
    end

    if @recipe.save