app/controllers/shopping_lists_controller.rb

  def index
    @shopping_list =
      current_profile.shopping_lists.last ||
      current_profile.shopping_lists.create

    if params[:refresh].present? || @shopping_list.items.blank?
      @shopping_list.generate_items
    end

    @recipes = current_profile.meal_plans.includes(:recipe).map(&:recipe).uniq
    @items   = @shopping_list.items || []

    if params[:recipe_id].present?
      @selected_recipe = Recipe.find_by(id: params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]

  def show
    @shopping_list = ShoppingList.find(params[:id])
---
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy_item
    @shopping_list = ShoppingList.find(params[:id])
    ingredient_name = params[:ingredient_name]

    if @shopping_list.items.present?
      @shopping_list.items =
        @shopping_list.items.reject { |i| i["name"] == ingredient_name }
      @shopping_list.save!
---
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "shopping_lists" SET "items" = $1, "updated_at" = $2 WHERE "shopping_lists"."id" = $3  [["items", "[{\"name\":\"Eggs\"}]"], ["updated_at", "2025-11-13 03:26:55.431993"], ["id", 32]]