app/controllers/user_profiles_controller.rb

INSERT INTO "user_profiles" ("appliances", "created_at", "dietary_preferences", "name", "updated_at", "weekly_budget") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user_profile = UserProfile.new(user_profile_params)
    if @user_profile.save

UPDATE "user_profiles" SET "appliances" = $1, "name" = $2, "updated_at" = $3, "weekly_budget" = $4 WHERE "user_profiles"."id" = $5  [["appliances", "{Microwave,\"Hot Plate\"}"], ["name", "Updated Alice"], ["updated_at", "2025-11-13 01:56:25.626425"], ["weekly_budget", 30.0], ["id", 65]]
---
  def update
    if @user_profile.update(user_profile_params)

DELETE FROM "user_profiles" WHERE "user_profiles"."id" = $1  [["id", 11]]
---
  def destroy
    profile_name = @user_profile.name

    # Clear session if deleting current profile
    if session[:user_profile_id] == @user_profile.id
      session[:user_profile_id] = nil
    end

    # Delete profile (will cascade delete meal_plans, shopping_lists)
    @user_profile.destroy

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 99999], ["LIMIT", 1]]
---
  def set_user_profile
    @user_profile = UserProfile.find(params[:id])